Documents/ВнесениеИзмененийВоВнутреннийПеречень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВнесениеИзмененийВоВнутреннийПеречень</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВнутренниеПеречни</xr:Item>
				<xr:Item>InformationRegister.ОснованияВнесенияВПеречень</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИзмененийПеречней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектИнсайдерскойИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыВнутреннихПеречней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьЧленаСоветаДиректоров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтверждающиеДокументыКвалифицированногоИнвестора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИсключенияКвалифицированногоЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийДокумент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НормативныйАкт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НормативныеАкты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НормативныеАкты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыАктивовКвалифицированныхИнвесторов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАктива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыВнутреннихПеречней</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВнесениеИзмененийВоВнутреннийПеречень/Ext/ManagerModule.bsl
// По переданным массивам определяет добавленные и удаленные элементы массива ВидыАктивовТекущие и относительно ВидыАктивовНаНачало
// и возвращает структуру со свойствами типа Массив ДобавленныеВидыАктивов, УдаленныеВидыАктивов
//	
// Параметры:
//		- ВидыАктивовНаНачало - Массив видов активов до изменения
//		- ВидыАктивовТекущие - Массив видов активов после изменения
//
Функция СформироватьСтруктуруИзмененийСоставаВидовАктивов(ВидыАктивовНаНачало, ВидыАктивовТекущие) Экспорт
	
	УдаленныеВидыАктивов	= Новый Массив;
	ДобавленныеВидыАктивов	= Новый Массив;
	
	Для Каждого ВидАктиваНаНачало Из ВидыАктивовНаНачало Цикл		
		Если ВидыАктивовТекущие.Найти(ВидАктиваНаНачало) = Неопределено Тогда
			УдаленныеВидыАктивов.Добавить(ВидАктиваНаНачало);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ВидАктиваТекущий Из ВидыАктивовТекущие Цикл		
		Если ВидыАктивовНаНачало.Найти(ВидАктиваТекущий) = Неопределено Тогда
			ДобавленныеВидыАктивов.Добавить(ВидАктиваТекущий);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("ДобавленныеВидыАктивов,УдаленныеВидыАктивов", ДобавленныеВидыАктивов, УдаленныеВидыАктивов);
	
КонецФункции

// Возвращает результат запроса по действующим видам активов квал. инвестора
// 
//	Параметры:
//		Организация - Организация
//		Объект - ЮрФизЛицо - квал. инвестор
//		ЗначениеГраницы - Дата или МоментВремени() - момент среза
//		ВключаяГраницу - Булево - признак включения ЗначениеГраницы в срез
//
Функция РезультатЗапросаПоВидамАктивов(Организация, Объект, ЗначениеГраницы, ВключаяГраницу = Ложь) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.ВидАктива КАК ВидАктива
		|ИЗ
		|	РегистрСведений.ОснованияВнесенияВПеречень.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Объект = &Объект
		|				И ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.КвалифицированныеИнвесторы)) КАК ОснованияВнесенияВПереченьСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнесениеИзмененийВоВнутреннийПеречень.ВидыАктивовКвалифицированныхИнвесторов КАК ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов
		|		ПО ОснованияВнесенияВПереченьСрезПоследних.Основание = ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.Ссылка
		|			И (ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.Ссылка.ВидИзменения <> ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Исключение))
		|ГДЕ
		|	НЕ ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.ВидАктива ЕСТЬ NULL");
	
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Объект", 		Объект);
	Запрос.УстановитьПараметр("Дата", 			Новый Граница(ЗначениеГраницы, ?(ВключаяГраницу, ВидГраницы.Включая, ВидГраницы.Исключая)));
	
	Возврат Запрос.Выполнить();
	
КонецФункции
